<?php

// Register Custom Taxonomy
function custom_taxonomy_ingredients() {
    $labels = array(
        'name'                       => _x( 'Ingredients', 'Taxonomy General Name', THEME_TEXTDOMAIN ),
        'singular_name'              => _x( 'Ingredients', 'Taxonomy Singular Name', THEME_TEXTDOMAIN ),
        'menu_name'                  => __( 'Ingredients', THEME_TEXTDOMAIN ),
        'all_items'                  => __( 'All Ingredients', THEME_TEXTDOMAIN ),
        'parent_item'                => __( 'Ingredient Category', THEME_TEXTDOMAIN ),
        'parent_item_colon'          => __( 'Ingredient Category:', THEME_TEXTDOMAIN ),
        'new_item_name'              => __( 'New Ingredient Name', THEME_TEXTDOMAIN ),
        'add_new_item'               => __( 'Add New Ingredient', THEME_TEXTDOMAIN ),
        'edit_item'                  => __( 'Edit Ingredient', THEME_TEXTDOMAIN ),
        'update_item'                => __( 'Update Ingredient', THEME_TEXTDOMAIN ),
        'view_item'                  => __( 'View Ingredient', THEME_TEXTDOMAIN ),
        'separate_items_with_commas' => __( 'Separate ingredients with commas', THEME_TEXTDOMAIN ),
        'add_or_remove_items'        => __( 'Add or remove ingredients', THEME_TEXTDOMAIN ),
        'choose_from_most_used'      => __( 'Choose from the most used', THEME_TEXTDOMAIN ),
        'popular_items'              => __( 'Popular Ingredients', THEME_TEXTDOMAIN ),
        'search_items'               => __( 'Search Ingredient', THEME_TEXTDOMAIN ),
        'not_found'                  => __( 'Not Found', THEME_TEXTDOMAIN ),
        'no_terms'                   => __( 'No Ingredients', THEME_TEXTDOMAIN ),
        'items_list'                 => __( 'Ingredients list', THEME_TEXTDOMAIN ),
        'items_list_navigation'      => __( 'Ingredients list navigation', THEME_TEXTDOMAIN ),
    );

    $args = array(
        'labels'                     => $labels,
        'hierarchical'               => true,
        'public'                     => true,
        'show_ui'                    => true,
        'show_admin_column'          => true,
        'show_in_nav_menus'          => true,
        'show_tagcloud'              => true,
        'meta_box_cb'                => false,
    );
    register_taxonomy( 'ingredients', array( 'post' ), $args );

}
add_action( 'init', 'custom_taxonomy_ingredients', 0 );






$ingredients = array(

    'Мясо' => array(
        array( 'Баранина1', '15.6', '16.3', '0.0', '209' ),
        array( 'Бараньи ребрышки', '17.0', '15.0', '0.0', '203' ),
        array( 'Говядина1', '18.9', '12.4', '0.0', '187' ),
        array( 'Голень индейки', '15.7', '8.9', '0.0', '142' ),
        array( 'Гусь1', '15.2', '39.0', '0.0', '412' ),
        array( 'Индейка', '17.8', '3.2', '4.1', '117' ),
        array( 'Кролик', '21.0', '8.0', '0.0', '156' ),
        array( 'Крыло индейки', '16.5', '11.4', '0.0', '168' ),
        array( 'Куриная грудка', '23.6', '1.9', '0.4', '113' ),
        array( 'Куриное филе', '23.1', '1.2', '0.0', '110' ),
        array( 'Куриные крылышки', '19.2', '12.2', '0.0', '186' ),
        array( 'Курица1', '16.0', '14.0', '0.0', '190' ),
        array( 'Лосятина', '21.4', '1.7', '0.0', '101' ),
        array( 'Оленина1', '19.5', '8.5', '0.0', '154' ),
        array( 'Перепела', '21.8', '4.5', '0.0', '134' ),
        array( 'Сало свиное', '2.4', '89.0', '0.0', '797' ),
        array( 'Свиная корейка', '17.0', '25.0', '', '301' ),
        array( 'Свиная рулька', '18.6', '24.7', '0.0', '294' ),
        array( 'Свиная шея', '13.6', '31.9', '0.0', '343' ),
        array( 'Свинина', '16.0', '21.6', '0.0', '259' ),
        array( 'Свиные ребра', '15.2', '29.3', '0.0', '321' ),
        array( 'Страус', '21.7', '1.2', '0.0', '98' ),
        array( 'Телятина', '30.7', '0.9', '0.0', '131' ),
        array( 'Утка', '13.5', '28.6', '0.0', '308' ),
        array( 'Говяжий фарш', '17.2', '20.0', '0.0', '254' ),
        array( 'Индейка фарш', '20.0', '8.0', '0.5', '161' ),
        array( 'Куриный фарш', '17.4', '8.1', '0.0', '143' ),
        array( 'Фарш мясной', '17.0', '21.0', '0.0', '263' ),
        array( 'Свиной фарш', '17.0', '21.0', '0.0', '263' ),
        array( 'Филе индейки', '19.2', '0.7', '0.0', '84' ),
        array( 'Яйцо куриное', '12.7', '10.9', '0.7', '157' ),
        array( 'Яйцо гусиное', '13.9', '13.3', '1.4', '185' ),
        array( 'Яйцо индюшиное', '13.1', '11.7', '0.7', '165' ),
        array( 'Яйцо перепелиное', '11.9', '13.1', '0.6', '168' ),
        array( 'Яйцо страусиное', '12.2', '11.7', '0.7', '118' ),
        array( 'Яйцо утиное', '13.3', '14.5', '0.1', '185' ),
        array( 'Яйцо черепашье', '10.0', '12.0', '0.8', '155' ),
        array( 'тестовое', '10.0', '12.0', '0.8', '155' ),

    ),

    'Молочные продукты' => array(
        array( 'Сгущенка', '7.2', '8.5', '56.0', '320' ),
        array( 'Вареная сгущенка', '6.40', '8.57', '55.19', '323' ),
        array( 'Кумыс из кобыльего молока', '2.1', '1.9', '5.0', '50' ),
        array( 'Кумыс из коровьего молока', '3.0', '0.1', '6.3', '41' ),
        array( 'Кумыс из коровьего молока обезжиренный', '1.5', '0.1', '2.1', '15' ),
        array( 'Молоко белковое', '4.3', '1.0', '6.4', '52' ),
        array( 'Молоко буйволиное', '4.0', '7.8', '4.9', '106' ),
        array( 'Молоко верблюжье', '4.0', '5.1', '4.9', '82' ),
        array( 'Молоко имбирное', '1.2', '1.0', '1.5', '21' ),
        array( 'Молоко кислое', '2.2', '2.5', '3.5', '60' ),
        array( 'Молоко кобылье', '2.2', '1.0', '5.8', '41' ),
        array( 'Молоко козье', '3.6', '3.3', '4.8', '68' ),
        array( 'Молоко коровье', '2.9', '3.5', '4.7', '62' ),
        array( 'Молоко кунжутное', '3.1', '8.1', '14.2', '142' ),
        array( 'Молоко овечье', '6.5', '7.7', '4.8', '110' ),
        array( 'Молоко ореховое', '3.7', '3.5', '21.3', '126' ),
        array( 'Молоко рисовое', '0.1', '1.3', '12.2', '60' ),
        array( 'Простокваша 0.1%', '3.0', '0.1', '3.8', '30' ),
        array( 'Простокваша 1%', '3.0', '1.0', '4.1', '40' ),
        array( 'Простокваша 2.5%', '2.9', '2.5', '4.1', '53' ),
        array( 'Простокваша 3.2%', '2.8', '3.2', '4.1', '58' ),
        array( 'Сыр Рикотта', '11.0', '13.0', '3.0', '174' ),
        array( 'Ряженка 1%', '3.0', '1.0', '4.2', '40' ),
        array( 'Ряженка 2.5%', '2.9', '2.5', '4.2', '54' ),
        array( 'Ряженка 3.2%', '2.9', '3.2', '4.1', '57' ),
        array( 'Ряженка 4%', '2.8', '4.0', '4.2', '67' ),
        array( 'Ряженка 6%', '5.0', '6.0', '4.1', '84' ),
        array( 'Сливки взбитые', '3.2', '22.2', '12.5', '257' ),
        array( 'Сливки сгущенные с сахаром', '6.1', '19.0', '53.0', '410' ),
        array( 'Сливки сухие', '23.0', '42.7', '26.3', '579' ),
        array( 'Сливки сухие высокожирные', '10.0', '75.0', '10.0', '753' ),
        array( 'Сметана 10%', '3.0', '10.0', '2.9', '115' ),
        array( 'Сметана 12%', '2.7', '12.0', '3.9', '133' ),
        array( 'Сметана 15%', '2.6', '15.0', '3.0', '158' ),
        array( 'Сметана 18%', '2.5', '18.0', '3.6', '184' ),
        array( 'Сметана 20%', '2.8', '20.0', '3.2', '206' ),
        array( 'Сметана 25%', '2.6', '25.0', '2.5', '248' ),
        array( 'Сметана 30%', '2.4', '30.0', '3.1', '294' ),
        array( 'Сметана 40%', '2.4', '40.0', '2.6', '381' ),
        array( 'Сыворотка', '0.8', '0.2', '3.5', '20' ),
        array( 'Сыр плавленый', '16.8', '11.2', '23.8', '257' ),
        array( 'Сыр плавленый шоколадный', '11.6', '18.5', '25.8', '311' ),
        array( 'Сыр Сулугуни', '20.0', '24.0', '0.0', '290' ),
        array( 'Сыр Адыгейский', '18.5', '14.0', '0.0', '240' ),
        array( 'Сыр Бри', '21.0', '23.0', '0.0', '291' ),
        array( 'Сыр брынза (из коровьего молока)', '17.9', '20.1', '0.0', '260' ),
        array( 'Сыр брынза (из овечьего молока)', '14.6', '25.5', '0.0', '298' ),
        array( 'Сыр Дор Блю', '21.0', '30.0', '0.0', '354' ),
        array( 'Сыр Камамбер', '21.0', '23.0', '0.0', '291' ),
        array( 'Сыр Козий', '21.3', '21.7', '0.7', '290' ),
        array( 'Сыр Маскарпоне', '4.8', '41.5', '4.8', '412' ),
        array( 'Сыр Моцарелла', '18.0', '24.0', '0.0', '240' ),
        array( 'Сыр Пармезан', '33.0', '28.0', '0.0', '392' ),
        array( 'Сыр Фета', '17.0', '24.0', '0.0', '290' ),
        array( 'Творог 0%', '16.5', '0.0', '1.3', '71' ),
        array( 'Творог 0.1%', '16.7', '0.1', '2.0', '76' ),
        array( 'Творог 0.2%', '18.0', '0.2', '1.8', '81' ),
        array( 'Творог 0.3%', '18.0', '0.3', '3.3', '90' ),
        array( 'Творог 0.6%', '18.0', '0.6', '1.8', '88' ),
        array( 'Творог 1%', '16.3', '1.0', '1.3', '79' ),
        array( 'Творог 1.8%', '18.0', '1.8', '3.3', '101' ),
        array( 'Творог 11%', '16.0', '11.0', '1.0', '170' ),
        array( 'Творог 18%', '14.0', '18.0', '2.8', '232' ),
        array( 'Творог 2%', '18.0', '2.0', '3.3', '103' ),
        array( 'Творог 4%', '15.7', '4.0', '1.4', '104' ),
        array( 'Творог 5%', '17.2', '5.0', '1.8', '121' ),
        array( 'Творог 8%', '15.0', '8.0', '1.5', '138' ),
        array( 'Творог 9%', '16.7', '9.0', '2.0', '159' ),
    ),

    'Субпродукты' => array(
        array( 'Куриные желудки', '18.2', '4.2', '0.6', '114' ),
        array( 'Говяжьи легкие', '16.2', '2.5', '0.0', '92' ),
        array( 'Говяжий хвост', '19.7', '6.5', '0.0', '137' ),
        array( 'Говяжий язык', '12.2', '10.9', '0.0', '146' ),
        array( 'Говяжье вымя', '12.3', '13.7', '0.0', '173' ),
        array( 'Говяжье сердце', '16.0', '3.5', '0.0', '96' ),
        array( 'Говяжьи губы', '15.0', '5.0', '0.0', '105' ),
        array( 'Говяжьи мозги', '11.7', '8.6', '0.0', '124' ),
        array( 'Говяжьи ноги', '25.0', '6.6', '0.0', '159' ),
        array( 'Говяжьи почки', '15.2', '2.8', '0.0', '86' ),
        array( 'Говяжьи ребра', '11.0', '35.0', '0.0', '359' ),
        array( 'Говяжьи уши', '25.2', '2.3', '0.0', '122' ),
        array( 'Говяжья вырезка', '18.6', '16.0', '0.0', '218' ),
        array( 'Говяжья вырезка филейная', '20.1', '3.5', '0.0', '113' ),
        array( 'Говяжья грудинка', '19.3', '15.7', '0.0', '217' ),
        array( 'Говяжья лопатка', '19.4', '6.6', '0.0', '137' ),
        array( 'Говяжья пашина', '18.9', '16.6', '0.0', '225' ),
        array( 'Говяжья печень', '20.0', '3.1', '4.0', '125' ),
        array( 'Говяжья шейная часть', '19.4', '6.4', '0.0', '135' ),
        array( 'Свиное сердце', '16.9', '4.8', '2.2', '118' ),
        array( 'Свиной окорок', '18.0', '21.3', '0.0', '261' ),
        array( 'Свиной ошеек', '16.1', '22.8', '0.0', '267' ),
        array( 'Свиной подгрудок', '7.4', '67.8', '0.0', '630' ),
        array( 'Свиной язык', '16.5', '11.1', '0.0', '165' ),
        array( 'Свиные легкие', '14.1', '2.7', '0.0', '85' ),
        array( 'Свиные ноги', '18.0', '16.0', '0.0', '216' ),
        array( 'Свиные почки', '16.8', '3.8', '0.0', '102' ),
        array( 'Свиные уши', '21.0', '14.1', '0.0', '211' ),
        array( 'Гусиная печень', '15.2', '39.0', '0.0', '412' ),
        array( 'Куриная печень', '19.1', '6.3', '0.6', '136' ),
        array( 'Свиная печень', '22.0', '3.4', '2.6', '130' ),
        array( 'Телячья печень', '19.2', '3.3', '4.1', '124' ),
        array( 'Печень трески', '4.2', '65.7', '1.2', '613' ),
        array( 'Утиная печень', '15.8', '38.0', '0.0', '405' ),
        array( 'Баранья печень', '18.7', '2.9', '0.0', '101' ),
        array( 'Бараньи почки', '13.6', '2.5', '0.0', '77' ),
        array( 'Куриное сердце', '15.8', '10.3', '0.8', '159' ),
        array( 'Баранье сердце', '13.5', '2.5', '0.0', '82' ),
        array( 'Бараний язык', '12.6', '16.1', '0.0', '195' ),
    ),

    'Рыба' => array(
        array( 'Анчоусы', '20.1', '6.1', '0', '135' ),
        array( 'Барабулька (султанка)', '19.4', '3.8', '0.0', '117' ),
        array( 'Амур белый', '18.6', '5.3', '0.0', '134' ),
        array( 'Амур чёрный', '17.5', '2.0', '0.0', '88' ),
        array( 'Голец', '22.4', '5.7', '0.0', '135' ),
        array( 'Горбуша', '20.5', '6.5', '0.0', '142' ),
        array( 'Дорадо', '18.0', '3.0', '0.0', '96' ),
        array( 'Жерех', '18.8', '2.6', '0.0', '98' ),
        array( 'Зубатка', '19.6', '5.3', '0.0', '126' ),
        array( 'Икра красная', '32.0', '15.0', '0.0', '263' ),
        array( 'Икра черная', '24.6', '17.9', '4', '264' ),
        array( 'Камбала', '16.5', '1.8', '0.0', '83' ),
        array( 'Карась', '17.7', '1.8', '0.0', '87' ),
        array( 'Карп', '16.0', '5.3', '0.0', '112' ),
        array( 'Кета', '22.0', '5.6', '0.0', '138' ),
        array( 'Кефаль', '21.0', '0.4', '0.0', '124' ),
        array( 'Кижуч', '21.6', '6.0', '0.0', '140' ),
        array( 'Килька', '14.1', '9.0', '0.0', '137' ),
        array( 'Корюшка', '15.4', '4.5', '0.0', '102' ),
        array( 'Ледяная', '17.7', '2.2', '0.0', '90' ),
        array( 'Лемонема', '15.9', '0.4', '0.0', '67' ),
        array( 'Лещ', '17.1', '4.1', '0.0', '105' ),
        array( 'Линь', '7.0', '1.8', '0.0', '40' ),
        array( 'Лосось', '19.8', '6.3', '0.0', '142' ),
        array( 'Масляная рыба', '18.8', '4.2', '0.0', '112' ),
        array( 'Минтай', '15.9', '0.9', '0.0', '72' ),
        array( 'Мойва', '13.4', '11.5', '0.0', '157' ),
        array( 'Налим', '18.8', '0.6', '0.0', '80' ),
        array( 'Нерка', '20.3', '8.4', '0.0', '157' ),
        array( 'Окунь морской', '15.3', '1.5', '0.0', '79' ),
        array( 'Окунь речной', '18.5', '0.9', '0.0', '82' ),
        array( 'Осетр', '16.4', '10.9', '0.0', '163' ),
        array( 'Палтус', '18.9', '3.0', '0.0', '102' ),
        array( 'Пангасиус', '15.0', '3.0', '', '89' ),
        array( 'Пеленгас', '18.0', '5.0', '0.0', '84' ),
        array( 'Раки', '15.5', '1.0', '1.2', '76' ),
        array( 'Ряпушка', '17.5', '2.0', '0.0', '88' ),
        array( 'Сазан азовский', '18.4', '5.3', '', '121' ),
        array( 'Сазан каспийский', '18.2', '2.7', '', '97' ),
        array( 'Сардина', '20.6', '9.6', '', '169' ),
        array( 'Сельдь', '16.3', '10.7', '', '161' ),
        array( 'Семга', '21.6', '6.0', '', '140' ),
        array( 'Сибас', '18.0', '3.0', '', '99' ),
        array( 'Скумбрия', '18.0', '13.2', '0.0', '191' ),
        array( 'Сом', '16.8', '8.5', '', '143' ),
        array( 'Стерлядь', '17.0', '6.1', '', '122' ),
        array( 'Судак', '19.2', '0.7', '', '84' ),
        array( 'Терпуг', '17.8', '3.4', '', '102' ),
        array( 'Тиляпия', '20.1', '1.7', '0.0', '96' ),
        array( 'Толстолобик', '19.5', '0.9', '0.2', '86' ),
        array( 'Треска', '17.7', '0.7', '', '78' ),
        array( 'Тунец', '23.0', '1.0', '', '101' ),
        array( 'Угорь', '14.5', '30.5', '', '332' ),
        array( 'Рыбный фарш', '16.0', '0.6', '0.0', '69' ),
        array( 'Форель', '19.2', '2.1', '', '97' ),
        array( 'Хек', '16.6', '2.2', '0.0', '86' ),
        array( 'Щука', '18.4', '0.8', '', '82' ),
    ),

    'Морепродукты' => array(
        array( 'Анчоусы', '20.1', '6.1', '0', '135' ),
        array( 'Кальмары', '19.0', '2.5', '1.8', '98' ),
        array( 'Крабовое мясо', '6.0', '1.0', '10.0', '73' ),
        array( 'Крабовые палочки', '6.0', '1.0', '10.0', '73' ),
        array( 'Креветки свежие', '22.0', '1.0', '0.0', '97' ),
        array( 'Креветки Королевские', '18.3', '1.2', '0.8', '87' ),
        array( 'Лангустины', '20.6', '1.5', '2.4', '112' ),
        array( 'Мидии', '17.5', '2.0', '0.0', '88' ),
        array( 'Морская капуста', '0.8', '5.1', '0.0', '49' ),
        array( 'Нори', '46.1', '0.1', '41.0', '349' ),
        array( 'Осьминог', '18.2', '0.0', '0.0', '73' ),
        array( 'Рапаны', '16.7', '1.1', '0.0', '77' ),
    ),

    'Овощи' => array(
        array( 'Баклажан', '1.2', '0.1', '4.5', '24' ),
        array( 'Брюква', '1.2', '0.1', '7.7', '37' ),
        array( 'Дайкон', '1.2', '0.0', '4.1', '21' ),
        array( 'Кабачок', '0.6', '0.3', '4.6', '24' ),
        array( 'Капуста белокочанная', '1.8', '0.1', '4.7', '27' ),
        array( 'Капуста Брокколи', '3.0', '0.4', '5.2', '28' ),
        array( 'Капуста брюссельская', '4.8', '0.0', '8.0', '43' ),
        array( 'Капуста кольраби', '2.8', '0.0', '10.7', '42' ),
        array( 'Капуста краснокочанная', '0.8', '0.0', '7.6', '24' ),
        array( 'Капуста пекинская', '1.2', '0.2', '2.0', '16' ),
        array( 'Капуста савойская', '1.2', '0.1', '6.0', '28' ),
        array( 'Капуста цветная', '2.5', '0.3', '5.4', '30' ),
        array( 'Картофель', '2.0', '0.4', '16.1', '76' ),
        array( 'Лук зелёный', '1.3', '0.0', '4.6', '19' ),
        array( 'Лук красный', '1.4', '0.0', '9.1', '42' ),
        array( 'Лук порей', '2.0', '0.0', '8.2', '33' ),
        array( 'Лук репчатый', '1.4', '0.0', '10.4', '47' ),
        array( 'Морковь', '1.3', '0.1', '6.9', '32' ),
        array( 'Овощи', '2.5', '0.1', '5.0', '31' ),
        array( 'Огурец', '0.8', '0.1', '2.8', '15' ),
        array( 'Капуста пак-чой', '1.5', '0.2', '2.2', '13' ),
        array( 'Патиссон', '0.6', '0.1', '4.3', '19' ),
        array( 'Перец болгарский', '1.3', '0.0', '5.3', '27' ),
        array( 'Перец сладкий', '1.3', '0.0', '5.3', '27' ),
        array( 'Перец чили', '2.0', '0.2', '9.5', '40' ),
        array( 'Помидор', '1.1', '0.2', '3.7', '20' ),
        array( 'Помидор зеленый', '1.2', '0.2', '5.1', '23' ),
        array( 'Ревень', '0.7', '0.1', '2.5', '13' ),
        array( 'Редис2', '1.2', '0.1', '3.4', '19' ),
        array( 'Редька зелёная', '2.0', '0.2', '6.5', '32' ),
        array( 'Редька красная', '1.2', '0.1', '3.4', '20' ),
        array( 'Редька маргеланская', '1.2', '0.0', '4.1', '21' ),
        array( 'Редька чёрная', '1.9', '0.2', '6.7', '35' ),
        array( 'Репа', '1.5', '0.1', '6.2', '30' ),
        array( 'Свекла', '1.5', '0.1', '8.8', '43' ),
        array( 'Сельдерей', '0.9', '0.1', '2.1', '12' ),
        array( 'Спаржа', '1.9', '0.1', '3.1', '20' ),
        array( 'Топинамбур', '2.1', '0.1', '12.8', '61' ),
        array( 'Тыква', '1.3', '0.3', '7.7', '28' ),
        array( 'Физалис', '1.0', '1.0', '3.9', '32' ),
        array( 'Хрен', '3.2', '0.4', '10.5', '56' ),
        array( 'Чайот', '0.8', '0.1', '2.8', '19' ),
        array( 'Чеснок', '6.5', '0.5', '29.9', '143' ),
    ),

    'Косточковые плоды' => array(
        array( 'Абрикос', '0.9', '0.1', '9.0', '44' ),
        array( 'Алыча', '0.2', '0.0', '6.9', '27' ),
        array( 'Маслины', '2.2', '10.5', '5.1', '166' ),
        array( 'Нектарин', '0.9', '0.2', '11.8', '48' ),
        array( 'Оливки', '0.8', '10.7', '6.3', '115' ),
        array( 'Персик', '0.9', '0.1', '11.3', '46' ),
        array( 'Слива', '0.8', '0.3', '9.6', '42' ),
        array( 'Терн', '1.5', '0.3', '9.4', '54' ),
    ),

    'Сухофрукты' => array(
        array( 'Изюм', '2.9', '0.6', '66.0', '264' ),
        array( 'Курага', '5.2', '0.3', '51.0', '215' ),
        array( 'Финики', '2.5', '0.5', '69.2', '274' ),
        array( 'Чернослив', '2.3', '0.7', '57.5', '231' ),
    ),

    'Фрукты' => array(
        array( 'Авокадо', '2.0', '20.0', '6.0', '212' ),
        array( 'Айва', '0.6', '0.5', '9.8', '40' ),
        array( 'Ананас', '0.4', '0.2', '10.6', '49' ),
        array( 'Апельсин', '0.9', '0.2', '8.1', '36' ),
        array( 'Арбуз', '0.6', '0.1', '5.8', '25' ),
        array( 'Банан', '1.5', '0.2', '21.8', '95' ),
        array( 'Виноград', '0.6', '0.2', '16.8', '65' ),
        array( 'Гранат', '0.9', '0.0', '13.9', '52' ),
        array( 'Грейпфрут', '0.7', '0.2', '6.5', '29' ),
        array( 'Груша', '0.4', '0.3', '10.9', '42' ),
        array( 'Дыня', '0.6', '0.3', '7.4', '33' ),
        array( 'Инжир', '0.7', '0.2', '13.7', '49' ),
        array( 'Киви', '1.0', '0.6', '10.3', '48' ),
        array( 'Лайм', '0.9', '0.1', '3.0', '16' ),
        array( 'Лимон', '0.9', '0.1', '3.0', '16' ),
        array( 'Манго', '0.5', '0.3', '11.5', '67' ),
        array( 'Мандарин', '0.8', '0.2', '7.5', '33' ),
        array( 'Фейхоа', '1.0', '1.0', '11.0', '49' ),
        array( 'Хурма', '0.5', '0.3', '15.3', '66' ),
        array( 'Яблоко', '0.4', '0.4', '9.8', '47' ),
    ),

    'Зелень' => array(
        array( 'Базилик свежий', '2.5', '0.6', '4.3', '27' ),
        array( 'Кинза', '2.1', '0.5', '1.9', '23' ),
        array( 'Крапива', '2.6', '0.3', '5.2', '33' ),
        array( 'Лук зеленый', '1.3', '0.0', '4.6', '19' ),
        array( 'Мята свежая', '3.7', '0.4', '8.0', '49' ),
        array( 'Одуванчик', '2.7', '0.7', '6.7', '45' ),
        array( 'Петрушка', '3.7', '0.4', '7.6', '47' ),
        array( 'Розмарин', '3.3', '5.9', '20.7', '131' ),
        array( 'Руккола', '2.6', '0.7', '2.1', '25' ),
        array( 'Салат Айсберг', '0.9', '0.1', '1.8', '14' ),
        array( 'Салат Латук', '1.2', '0.3', '1.3', '12' ),
        array( 'Укроп', '2.5', '0.5', '6.3', '38' ),
        array( 'Черемша', '2.4', '0.1', '6.5', '35' ),
        array( 'Шпинат', '2.9', '0.3', '2.0', '22' ),
        array( 'Щавель', '1.5', '0.3', '2.9', '19' ),
    ),

    'Бобовые' => array(
        array( 'Арахис', '26.3', '45.2', '9.9', '622' ),
        array( 'Бобы', '6.0', '0.1', '8.5', '57' ),
        array( 'Горох', '4.7', '0.5', '12.3', '69' ),
        array( 'Горошек зеленый замороженный', '6.4', '0.4', '16.3', '72' ),
        array( 'Горошек зеленый', '5.0', '0.2', '13.8', '73' ),
        array( 'Горошек зеленый консервированный', '3.6', '0.1', '9.8', '55' ),
        array( 'Маш', '23.5', '2.0', '46.0', '300' ),
        array( 'Нут', '19.0', '6.0', '61.0', '364' ),
        array( 'Соевые бобы', '25.83', '13.13', '16.63', '289' ),
        array( 'Соя', '34.9', '17.3', '17.3', '381' ),
        array( 'Фасоль стручковая', '2.0', '0.2', '3.6', '24' ),
        array( 'Фасоль белая', '20.9', '1.8', '64.0', '325' ),
        array( 'Фасоль красная', '21.0', '1.6', '52.7', '310' ),
        array( 'Фасоль чёрная', '8.9', '0.5', '23.7', '132' ),
        array( 'Чечевица красная', '21.6', '1.1', '48.0', '314' ),
        array( 'Чечевица', '6.7', '7.5', '5.0', '115' ),
        array( 'Чечевица желтая', '23.58', '1.52', '47.61', '296' ),
        array( 'Чечевица зеленая', '23.08', '1.30', '48.08', '296' ),
        array( 'Чечевица черная', '23.67', '1.03', '55.00', '324' ),
    ),

    'Злаковые' => array(
        array( 'Булгур', '12.3', '1.3', '57.6', '342' ),
        array( 'Геркулес', '2.3', '6.3', '15.4', '127' ),
        array( 'Гречка', '9.6', '8.8', '62.2', '354' ),
        array( 'Киноа', '14.1', '6.1', '57.2', '368' ),
        array( 'Кукуруза сладкая в початках', '3.5', '2.8', '15.6', '101' ),
        array( 'Кукурузная крупа', '8.3', '1.2', '75.0', '337' ),
        array( 'Манная крупа', '10.3', '1.0', '67.4', '328' ),
        array( 'Овес', '10.15', '5.57', '44.43', '296' ),
        array( 'Пшеничные отруби', '14.7', '4.1', '20.6', '180' ),
        array( 'Ржаные отруби', '11.2', '3.2', '32.0', '221' ),
        array( 'Рисовые отруби', '13.4', '20.9', '28.9', '316' ),
        array( 'Овсяные отруби', '18.0', '7.7', '45.3', '320' ),
        array( 'Перловая крупа', '9.3', '1.1', '73.7', '320' ),
        array( 'Пшеничная крупа', '11.5', '1.3', '62.0', '316' ),
        array( 'Пшено', '12.00', '2.90', '69.30', '334' ),
        array( 'Рис белый', '6.7', '0.7', '78.9', '344' ),
        array( 'Рис бурый', '7.4', '1.8', '72.9', '337' ),
        array( 'Рис длиннозерный', '7.1', '0.7', '78.0', '365' ),
        array( 'Рис золотистый', '8.1', '0.4', '78.0', '349' ),
        array( 'Рис коричневый', '6.3', '4.4', '65.1', '331' ),
        array( 'Ячменная крупа', '10.0', '1.3', '71.7', '324' ),
    ),

    'Грибы' => array(
        array( 'Белые грибы', '3.7', '1.7', '1.1', '34' ),
        array( 'Вешенки свежие', '2.5', '0.3', '6.5', '38' ),
        array( 'Грузди свежие', '1.8', '0.5', '0.8', '16' ),
        array( 'Лисички свежие', '1.6', '1.1', '2.2', '20' ),
        array( 'Маслята свежие', '2.4', '0.7', '1.7', '19' ),
        array( 'Моховик свежий', '1.7', '0.7', '1.5', '19' ),
        array( 'Опята свежие', '2.2', '1.2', '0.5', '17' ),
        array( 'Подберезовики свежие', '2.3', '0.9', '3.7', '31' ),
        array( 'Подосиновики свежие', '3.3', '0.5', '3.7', '22' ),
        array( 'Рыжики свежие', '1.9', '0.8', '2.7', '17' ),
        array( 'Сыроежки свежие', '1.7', '0.7', '1.5', '15' ),
        array( 'Шампиньоны свежие', '4.3', '1.0', '0.1', '27' ),
    ),

    'Семена и орехи' => array(
        array( 'Грецкий орех', '15.2', '65.2', '7.0', '654' ),
        array( 'Каштан свежий', '3.4', '3.0', '30.6', '166' ),
        array( 'Кокосовый орех', '3.4', '33.5', '6.2', '354' ),
        array( 'Кокосовая стружка', '13.0', '65.0', '14.0', '693' ),
        array( 'Мак', '17.5', '47.5', '2.0', '505' ),
        array( 'Миндаль сладкий', '18.6', '57.7', '16.2', '645' ),
        array( 'Кедровые орехи', '15.6', '56.0', '28.4', '680' ),
        array( 'Орех пекан', '9.2', '72.0', '4.3', '691' ),
        array( 'Кунжут', '19.4', '48.7', '12.2', '565' ),
        array( 'Семена льна', '18.3', '42.2', '28.9', '534' ),
        array( 'Фисташки', '20.0', '50.0', '7.0', '556' ),
        array( 'Фундук', '16.1', '66.9', '9.9', '704' ),
        array( 'Семена чиа', '16.5', '30.7', '42.1', '512' ),
    ),

    'Мучные изделия' => array(
        array( 'Крахмал картофельный', '0.1', '0.0', '79.6', '300' ),
        array( 'Крахмал кукурузный', '1.0', '0.6', '85.2', '329' ),
        array( 'Крахмал тапиоковый', '0.0', '0.0', '88.0', '360' ),
        array( 'Мука амарантовая', '8.9', '1.7', '61.7', '298' ),
        array( 'Мука гороховая', '21.0', '2.0', '49.0', '298' ),
        array( 'Мука гречневая', '13.6', '1.2', '73.7', '367' ),
        array( 'Мука кедровая', '31.0', '19.0', '33.0', '432' ),
        array( 'Мука конопляная', '30.0', '7.9', '24.7', '290' ),
        array( 'Мука кукурузная', '8.0', '1.0', '75.0', '330' ),
        array( 'Мука кунжутная', '45.0', '12.0', '32.0', '462' ),
        array( 'Мука льняная', '36.0', '10.0', '9.0', '270' ),
        array( 'Мука миндальная', '25.8', '54.5', '13.0', '602' ),
        array( 'Мука нутовая', '10.9', '2.9', '66.0', '337' ),
        array( 'Мука овсяная', '11.9', '5.8', '65.4', '306' ),
        array( 'Мука полбы', '17.0', '2.4', '67.8', '361' ),
        array( 'Мука пшеничная', '9.2', '1.2', '74.9', '342' ),
        array( 'Мука ржаная', '9.0', '1.0', '73.0', '325' ),
        array( 'Мука рисовая', '7.0', '0.6', '77.3', '321' ),
        array( 'Мука соевая', '36.5', '18.6', '17.9', '385' ),
        array( 'Мука ячменная', '10.0', '1.6', '56.1', '284' ),
    ),

    'Макаронные изделия' => array(
        array( 'Вермишель', '3.4', '0.4', '23.7', '114' ),
        array( 'Гречневая лапша', '14.7', '0.9', '70.5', '348' ),
        array( 'Каннеллони', '11.5', '1.9', '71.8', '350' ),
        array( 'Лапша удон', '10.4', '1.1', '69.7', '337' ),
        array( 'Макароны', '10.4', '1.1', '69.7', '337' ),
        array( 'Спагетти', '10.4', '1.1', '71.5', '344' ),
        array( 'Фарфалле', '10.4', '1.1', '71.5', '344' ),
        array( 'Фетучини', '14.1', '4.4', '67.6', '384' ),
        array( 'Фунчоза', '0.7', '0.5', '84.0', '320' ),
    ),

    'Ягоды' => array(
        array( 'Барбарис', '0.0', '0.0', '7.9', '29' ),
        array( 'Брусника', '0.7', '0.5', '9.6', '43' ),
        array( 'Бузина', '0.7', '0.5', '11.4', '73' ),
        array( 'Вишня', '0.8', '0.5', '11.3', '52' ),
        array( 'Голубика', '1.0', '0.0', '8.2', '35' ),
        array( 'Ежевика', '2.0', '0.0', '6.4', '31' ),
        array( 'Жимолость', '0.0', '0.0', '7.8', '30' ),
        array( 'Земляника', '0.8', '0.4', '7.5', '41' ),
        array( 'Ирга', '0.0', '0.0', '12.0', '45' ),
        array( 'Калина', '0.0', '0.0', '7.0', '26' ),
        array( 'Кизил', '1.0', '0.0', '10.5', '44' ),
        array( 'Клубника', '0.8', '0.4', '7.5', '41' ),
        array( 'Клюква', '0.5', '0.0', '6.8', '26' ),
        array( 'Крыжовник', '0.7', '0.2', '12.0', '43' ),
        array( 'Малина', '0.8', '0.5', '8.3', '46' ),
        array( 'Морошка', '0.8', '0.0', '9.8', '28' ),
        array( 'Облепиха', '1.2', '5.4', '5.7', '82' ),
        array( 'Рябина', '1.5', '0.1', '10.9', '50' ),
        array( 'Смородина белая', '0.5', '0.2', '8.0', '42' ),
        array( 'Смородина красная', '0.6', '0.2', '7.7', '43' ),
        array( 'Смородина черная', '1.0', '0.4', '7.3', '44' ),
        array( 'Черешня', '1.1', '0.4', '11.5', '50' ),
        array( 'Черника', '1.1', '0.4', '7.6', '44' ),
        array( 'Шелковица', '0.7', '0.0', '13.6', '52' ),
        array( 'Шиповник', '1.6', '0.0', '14.0', '51' ),
    ),

    'Чай и Кофе' => array(
        array( 'Чай каркаде', '0.3', '0.0', '0.6', '5' ),
        array( 'Кофе зеленый сухой', '12.3', '0.2', '35.7', '222' ),
        array( 'Кофе натуральный молотый сухой', '13.9', '14.4', '4.1', '201' ),
        array( 'Цикорий', '1.7', '0.2', '4.1', '21' ),
        array( 'Чай зеленый', '0.0', '0.0', '0.0', '0' ),
        array( 'Чай черный', '0.1', '0.0', '0.0', '0' ),
    ),

    'Какао и Шоколад' => array(
        array( 'Какао', '13.5', '54.0', '17.8', '607' ),
        array( 'Шоколад', '5.4', '35.3', '56.5', '544' ),
    ),

    'Специи и Приправы' => array(
        array( 'Имбирь', '1.8', '0.8', '15.8', '80' ),
        array( 'Корица', '3.9', '3.2', '79.8', '261' ),
        array( 'Паприка', '14.1', '12.8', '34.0', '358' ),
        array( 'Перец чёрный горошек', '14.7', '3.0', '41.6', '252' ),
        array( 'Перец чёрный молотый', '10.4', '3.3', '38.7', '251' ),
        array( 'Сахар-песок', '0.0', '0.0', '99.7', '398' ),
        array( 'Сахарная пудра', '0.0', '0.0', '99.8', '374' ),
    ),

    'Масло' => array(
        array( 'Маргарин сливочный', '0.5', '82.0', '0.0', '745' ),
        array( 'Масло оливковое', '0.0', '99.8', '0.0', '898' ),
        array( 'Масло подсолнечное', '0.0', '99.9', '0.0', '900' ),
        array( 'Масло растительное', '0.0', '99.0', '0.0', '899' ),
        array( 'Масло сливочное', '0.5', '82.5', '0.8', '748' ),
        array( 'Масло ореховое', '0.0', '100.0', '0.0', '899' ),
        array( 'Масло пальмовое', '0.0', '99.9', '0.0', '899' ),
    ),

    'Разные продукты' => array(
        array( 'Желатин', '87.2', '0.4', '0.7', '355' ),
        array( 'Мёд акациевый', '0.8', '0.0', '71.0', '288' ),
        array( 'Мёд вересковый', '0.8', '0.0', '81.5', '329' ),
        array( 'Мёд гречишный', '0.5', '0.0', '76.8', '309' ),
        array( 'Мёд дягилевый', '0.2', '0.0', '82.0', '329' ),
        array( 'Мёд искусственный', '0.0', '0.0', '77.0', '308' ),
        array( 'Мёд липовый', '0.6', '0.0', '79.7', '323' ),
        array( 'Мёд майский', '0.3', '0.0', '82.4', '331' ),
        array( 'Мёд монофлорный', '0.8', '0.0', '80.3', '324' ),
        array( 'Мёд падевый', '0.8', '0.0', '80.3', '324' ),
        array( 'Мёд подсолнечный', '1.0', '0.0', '79.0', '320' ),
        array( 'Мёд рапсовый', '0.8', '0.0', '81.5', '329' ),
        array( 'Мёд цветочный', '0.3', '0.0', '80.1', '322' ),
        array( 'Томатная паста', '2.5', '0.3', '16.7', '80' ),
        array( 'Уксус белый винный', '0.0', '0.0', '5.9', '14' ),
        array( 'Уксус рисовый', '0.3', '0.0', '13.0', '54' ),
        array( 'Уксус столовый 9%', '0.0', '0.0', '3.0', '32' ),
        array( 'Уксус яблочный 3%', '0.0', '0.0', '2.3', '11' ),
        array( 'Уксус яблочный 5%', '0.0', '0.0', '0.7', '18' ),
        array( 'Уксус яблочный 6%', '0.0', '0.0', '7.2', '14' ),
    ),

    'Соусы' => array(
        array( 'Горчица', '5.7', '6.4', '22.0', '162' ),
        array( 'Майонез столовый молочный', '2.4', '67.0', '3.9', '627' ),
        array( 'Соус соевый', '9.0', '2.0', '13.0', '52' ),
    ),

    'Полуфабрикаты' => array(
        array( 'Ананас консервированный', '0.1', '0.1', '14.0', '57' ),
        array( 'Рыбные консервы', '17.5', '2.0', '0.0', '88' ),
        array( 'Тесто дрожжевое', '5.8', '6.4', '49.3', '274' ),
        array( 'Тесто слоеное дрожжевое', '6.1', '21.3', '36.3', '362' ),
        array( 'Тесто фило', '7.0', '20.0', '48.0', '441' ),
        array( 'Тесто песочное', '6.5', '21.6', '49.9', '403' ),
        array( 'Тесто пресное', '9.0', '3.0', '40.6', '225' ),
        array( 'Тесто пряничное', '4.8', '2.8', '77.7', '336' ),
        array( 'Тесто рубленое', '6.0', '17.2', '40.2', '304' ),
        array( 'Тесто для пельменей', '7.9', '1.4', '50.6', '234' ),
        array( 'Тунец консервированный', '21.0', '1.2', '0.0', '96' ),
        array( 'Шампиньоны консервированные', '1.6', '0.2', '0.9', '12' ),
    ),

);

$ingredient_properties = [
	1 => 'protein',
	2 => 'fat',
	3 => 'carbs',
	4 => 'kcal'
];


function add_all_ingredients() {

    global $ingredients, $ingredient_properties;

    $args  = array(
        'taxonomy'   => 'ingredients',
        'hide_empty' => false,
    );
    $terms = get_terms( $args );

    if ( ! is_wp_error( $terms ) ) {

        foreach ( $ingredients as $ing_cat => $ingredient_list ) {

            $parent_id = 0;

            // check exists
            $parent_term = term_exists( $ing_cat, 'ingredients' );
            if ( ! empty( $parent_term['term_id'] ) ) $parent_id = $parent_term['term_id'];

            // add new parent ingredient cat
            $parent = wp_insert_term( $ing_cat, 'ingredients', array(
                'parent'      => 0,
            ) );

            // check errors
            if ( ! is_wp_error( $parent ) ) $parent_id = $parent['term_id'];

            // if parent exists
            if ( ! empty( $parent_id ) ) {
                foreach ( $ingredient_list as $item ) {

                    $ingredient_id = 0;

                    $ingredient_exists = term_exists( $item[0], 'ingredients' );
                    if ( ! empty( $ingredient_exists['term_id'] ) ) {
                        $ingredient_id = $ingredient_exists['term_id'];
                    } else {
                        $ingredient_id = wp_insert_term( $item[0], 'ingredients', array(
                            'parent'      => $parent_id,
                            'slug'        => '',
                        ) );

                        if ( ! is_wp_error( $ingredient_id ) ) {
                            $ingredient_id = $ingredient_id['term_id'];
                        }
                    }

                    // add nutrition info
	                if ( ! empty( $ingredient_id ) ) {
		                foreach ( $ingredient_properties as $k => $prop ) {
			                if ( get_term_meta( $ingredient_id, $prop, true ) ) {
				                continue;
			                }
			                update_term_meta( $ingredient_id, $prop, $item[ $k ] );
		                }
	                }
                }
            }
        }
    }
}

function default_setup_all_ingredients() {
    add_all_ingredients();
    update_option( '__default_setup__all_ingredients', 1, true );
}

add_action( 'init', 'default_setup_all_ingredients');